Revit 2027 API
BalusterPattern.DuplicateBaluster Method
 Duplicates the baluster pointed by given index in the main baluster pattern.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BalusterInfo DuplicateBaluster(
	int index
)
Public Function DuplicateBaluster (
	index As Integer
) As BalusterInfo
public:
BalusterInfo^ DuplicateBaluster(
	int index
)
member DuplicateBaluster :
        index : int -> BalusterInfo
Parameters
index Int32
 Baluster index.
Return Value
BalusterInfo
 The duplicated baluster.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index index is out of range.
Remarks
 The new baluster will be inserted just after the source baluster.
See Also
Reference
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace